Repository: matheus-rosa11/StandManager
Catalog: api/StandManager/Resources/SharedResources.*.resx
Languages: pt_br

# errors.order.customer_name_required
source: Customer name is required.
pt_br: O nome do cliente é obrigatório.

# errors.order.customer_session_not_found
source: The specified customer session could not be found.
pt_br: A sessão do cliente informada não foi encontrada.

# errors.flavor.name_exists
source: A pastel flavor with this name already exists.
pt_br: Já existe um sabor de pastel com esse nome.

# errors.flavor.not_found
source: The requested pastel flavor could not be found.
pt_br: O sabor de pastel solicitado não foi encontrado.

# errors.flavor.out_of_stock
source: Flavor '{0}' is out of stock for the requested quantity.
pt_br: O sabor "{0}" não possui quantidade disponível suficiente.

# errors.order.invalid_status_transition
source: The requested status change is not allowed.
pt_br: A mudança de status solicitada não é permitida.

# errors.order.item_already_final
source: The order item is already at the final stage.
pt_br: O item do pedido já está na etapa final.

# errors.order.item_completed
source: The order item has already been completed.
pt_br: O item do pedido já foi concluído.

# errors.order.item_not_found
source: The requested order item could not be found.
pt_br: O item do pedido solicitado não foi encontrado.

# errors.order.must_have_items
source: An order must contain at least one pastel flavor.
pt_br: O pedido deve conter ao menos um sabor de pastel.

# ErrorRequestCancelled
source: The request was cancelled by the client.
pt_br: A requisição foi cancelada pelo cliente.

# ErrorConcurrencyConflict
source: A concurrency conflict occurred while processing your request.
pt_br: Ocorreu um conflito de concorrência ao processar sua requisição.

# ErrorDatabaseWrite
source: An error occurred while persisting data.
pt_br: Ocorreu um erro ao persistir os dados.

# ErrorDatabaseUnavailable
source: The database is currently unavailable. Please try again later.
pt_br: O banco de dados está indisponível no momento. Tente novamente mais tarde.

# ErrorUnexpected
source: An unexpected error occurred while processing your request.
pt_br: Ocorreu um erro inesperado ao processar sua requisição.
